announcements/mail-on-the-emacspeak-desktop.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-04-22 Sat 20:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Email On The Emacspeak Audio Desktop</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="raman" />
</head>
<body>
<div id="content">
<h1 class="title">Email On The Emacspeak Audio Desktop</h1>
<div id="outline-container-orgc57f2b7" class="outline-2">
<h2 id="orgc57f2b7"><span class="section-number-2">1</span> Overview</h2>
<div class="outline-text-2" id="text-1">
<p>
This question comes up every few months on the emacspeak mailing
list. In general, see
<a href="https://tvraman.github.io/emacspeak/applications.html">Emacspeak Tools</a> to quickly discover available speech-enabled
applications. This article outlines some of the available email setups
given the wide degree of variance in this space.
</p>
</div>
</div>

<div id="outline-container-org472e202" class="outline-2">
<h2 id="org472e202"><span class="section-number-2">2</span> Background</h2>
<div class="outline-text-2" id="text-2">
<p>
How one puts together an email environment is a function of the
following:
</p>

<ol class="org-ol">
<li>How email is retrieved.</li>
<li>How email is stored (if storing locally).</li>
<li>How email is sent.</li>
</ol>

<p>
Here is an overview of what is available as viewed from the world of
Linux in general and Emacs in particular: 
</p>
</div>


<div id="outline-container-org6bfd003" class="outline-3">
<h3 id="org6bfd003"><span class="section-number-3">2.1</span> Email Retrieval</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Email can be retrieved in a number of ways:
</p>

<ul class="org-ul">
<li>IMap via Emacs This is implemented well in GNUS, and poorly in
Emacs/VM. Note that Emacs is single-threaded, and fetching large
volumes of email via IMap is painful.</li>
<li>Batch Retrieval: IMap Tools like <span class="underline">fetchmail</span>, <span class="underline">offlineimap</span> and friends that live
outside of Emacs can be used to batch-retrieve email in the
background. The retrieved mail gets delivered <i>locally</i> as in the past.</li>
<li>Mail Filtering: UNIX <span class="underline">procmail</span> enables filtering of locally
delivered email into separate folders for automatically organizing
incoming email.</li>
</ul>
</div>
</div>


<div id="outline-container-orgc17c2ee" class="outline-3">
<h3 id="orgc17c2ee"><span class="section-number-3">2.2</span> Sending Email</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Sending email involves:
</p>

<ol class="org-ol">
<li>Composing email &#x2014; typically invoked  via key-sequence  <span class="underline">C-x m</span>
(command: <i>compose-mail</i>). Emacs email packages implement
specific versions of this command, e.g. <i>vm-mail</i> from package
<span class="underline">emacs/vm</span>, <i>message-mail</i> from the <span class="underline">message</span> package etc.</li>
<li>Sending email: This is specific to the email provider being used,
e.g., <i>GMail</i>. In the past, UNIX machines could talk <i>SMTP</i> to
the Mail Gateway, but this has mostly disappeared over time. For
an example of how to configure Emacs to send email via GMail
using SMTP , see file <a href="https://github.com/tvraman/emacspeak/blob/master/tvr/gm-smtp.el#L1">tvr/gm-smtp.el</a> in the emacspeak repository.</li>
</ol>
</div>
</div>



<div id="outline-container-orgc45b6b3" class="outline-3">
<h3 id="orgc45b6b3"><span class="section-number-3">2.3</span> Local Storage Format</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>UNIX Mail:       An email folder is a file of messages. This
format is used by clients like Emacs/VM, UNIX Mail etc.</li>
<li>Maildir:  A mail folder  is a directory, with
individual email messages living in files of their
own. Sample clients include MH-E (UNIX MH), MU4E.</li>
<li>RMail     This is Emacs' original email format.</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org49386ea" class="outline-2">
<h2 id="org49386ea"><span class="section-number-2">3</span> Putting It All Together</h2>
<div class="outline-text-2" id="text-3">
<p>
The next sections show my present email setup put together using the
building blocks described above. 
</p>

<ol class="org-ol">
<li>I use Linux on all my machines, and Android on my phone.</li>
<li>I mostly limit email usage on my phone  to get a quick overview of email that might require immediate attention &#x2014; toward this end, I have a <i>to-mobile</i> GMail label that collects urgent messages.</li>
<li>Linux is where I handle email in volume.</li>
<li>I use my <i>Inbox</i> as</li>
</ol>
<p>
my ToDo list &#x2014; which means that I leave little or no email in my
<i>Inbox</i> unless I'm on vacation and disconnected from email.
</p>
</div>

<div id="outline-container-orge0a9247" class="outline-3">
<h3 id="orge0a9247"><span class="section-number-3">3.1</span> Desktop: Batch Retrieval  And Emacs/VM</h3>
<div class="outline-text-3" id="text-3-1">
<p>
This is the email setup on my workstation. See next section for the
email setup while mobile.
</p>

<ol class="org-ol">
<li>I batch-retrieve   email using <span class="underline">fetchmail</span>.</li>
<li>This email gets filtered through <span class="underline">procmail</span> and auto-filed into
several folders based on a set of procmail rules. Typical rules
include separating out various email lists into their  respective folders.</li>
<li>Note that this does not preclude using <span class="underline">IMap</span> via GNUS   to  read
email while online.</li>
<li>Email that is not filtered into separate folders  e.g. email that
is sent directly to me, email regarding projects that need
immediate attention etc., land up in folder <span class="underline">~/mbox</span>.</li>
<li>So when I launch <span class="underline">emacs/vm</span> on my desktop, the above is all I
need to deal with at any given moment.</li>
<li>I typically read Auto-filed mailing lists  using <span class="underline">emacs/vm</span> about once a day or
less &#x2014; I use package <span class="underline">mspools</span>  to get a quick overview of the
state of those mail folders.</li>
</ol>
</div>
</div>

<div id="outline-container-orgd7ebcf5" class="outline-3">
<h3 id="orgd7ebcf5"><span class="section-number-3">3.2</span> Mobile AccessOn Laptop: GNUS And IMap</h3>
<div class="outline-text-3" id="text-3-2">
<p>
See  <a href="https://github.com/tvraman/emacspeak/blob/master/tvr/gnus-prepare.el#L1">gnus-prepare.el</a> for my <span class="underline">gnus</span> configuration for accessing GMail
via <span class="underline">imap</span>. That configuration is setup to access multiple GMail accounts.
</p>

<ol class="org-ol">
<li>I see each GMail label as a separate group in <span class="underline">GNUS</span>.</li>
<li>I only sync  high-priority labels &#x2014; this works well even
over slow WIFI connections while on the road. As an example, the
afore-mentioned <i>to-mobile</i> GMail label is a high-priority group.</li>
<li>Module <span class="underline">gm-nnir</span> defines a  <span class="underline">GNUS/GMail</span> extension that enables
one to search GMail using GMail's search operators &#x2014; that is my
preferred means of quickly finding email messages using
search. This is very fast since the search happens server-side,
and  only email headers are retrieved when displaying the search
hits.</li>
<li>Note that this solution is not laptop/mobile specific &#x2014; I  use
this setup for searching GMail   from my desktop as well.</li>
</ol>
</div>
</div>

<div id="outline-container-orgea285cc" class="outline-3">
<h3 id="orgea285cc"><span class="section-number-3">3.3</span> Composing And Sending EMail</h3>
<div class="outline-text-3" id="text-3-3">
<ol class="org-ol">
<li>I use <i>compose-mail</i> to compose email.</li>
<li>I optionally activate <span class="underline">orgtbl-mode</span> and/or  <span class="underline">orgstruct-mode</span> if
editing structured content within the email body.</li>
<li>I send email out using the setup in  <a href="https://github.com/tvraman/emacspeak/blob/master/tvr/gm-smtp.el#L1">gm-smtp.el</a>.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org9b97991" class="outline-2">
<h2 id="org9b97991"><span class="section-number-2">4</span> Conclusion</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>Email in Linux/Emacs  is  composed of a set of
independent building blocks &#x2014; this gives maximal flexibility.</li>
<li>That flexibility allows one to put together different email
workflows depending on the connectivity environment in use.</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2017-04-22 Sat 00:00</p>
<p class="author">Author: raman</p>
<p class="date">Created: 2017-04-22 Sat 20:06</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
